In [1]:
%matplotlib inline
import pandas as pd

from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [ ]:
# How many movies are listed in the titles dataframe?

In [6]:
titles.shape  ##ans-->244914

(244914, 2)

In [ ]:
# What are the earliest two films listed in the titles dataframe?

In [11]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

In [ ]:
# How many movies have the title "Hamlet"?

In [19]:
a=len(titles[titles.title == 'Hamlet'])
a

20

In [ ]:
# How many movies are titled "North by Northwest"?

In [18]:
len(titles[titles.title == 'North by Northwest'])

1

In [ ]:
# List all of the "Treasure Island" movies from earliest to most recent

In [30]:
titles[titles.title == "Treasure Island"].sort_values('year').head(10)

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

In [ ]:
# When was the first movie titled "Hamlet" made?

In [31]:
titles[titles.title == "Hamlet"].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

In [ ]:
# How many movies were made in the year 1950?

In [41]:
len(titles[titles.year == 1950])

1113

In [ ]:
# How many movies were made in the year 1960?

In [42]:
len(titles[titles.year == 1960])

1549

In [ ]:
# How many movies were made from 1950 through 1959?

In [45]:
len(titles[(1950<=titles.year)&(titles.year<=1959)])

12934

In [3]:
import pandas as pd
release=pd.read_csv('release_dates.csv')

In [48]:
release.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [ ]:
# In what years has a movie titled "Batman" been released?

In [55]:
r=release 
r[r.title =="Batman"].sort_values('year')

        title  year         country        date
39316  Batman  1943             USA  1943-07-16
39317  Batman  1943          Mexico  1946-11-01
39318  Batman  1943        Portugal  1950-05-29
39319  Batman  1943    West Germany  1966-06-19
39336  Batman  1989    West Germany  1989-10-26
39337  Batman  1989          Greece  1989-10-27
39338  Batman  1989       Hong Kong  1989-11-02
39339  Batman  1989      Yugoslavia  1989-11-21
39340  Batman  1989        Colombia  1989-11-23
39342  Batman  1989         Hungary  1989-12-21
39335  Batman  1989          Brazil  1989-10-26
39343  Batman  1989           Japan  1989-12-23
39344  Batman  1989         Uruguay  1989-12-25
39345  Batman  1989          Poland  1989-12-31
39346  Batman  1989           India  1990-03-13
39341  Batman  1989       Argentina  1989-12-14
39334  Batman  1989          Sweden  1989-10-20
39332  Batman  1989         Finland  1989-10-20
39347  Batman  1989     South Korea  1990-07-07
39331  Batman  1989          Taiwan  1989-10-07
39330  Batman  1989          Norway  1989-10-05
39329  Batman  1989           Spain  1989-09-29
39328  Batman  1989        Portugal  1989-09-29
39327  Batman  1989     Netherlands  1989-09-29
39326  Batman  1989         Denmark  1989-09-29
39325  Batman  1989          France  1989-09-13
39324  Batman  1989         Belgium  1989-09-13
39323  Batman  1989       Australia  1989-08-31
39322  Batman  1989              UK  1989-08-11
39321  Batman  1989         Ireland  1989-08-11
39320  Batman  1989             USA  1989-06-23
39333  Batman  1989           Italy  1989-10-20
39348  Batman  1989  Czechoslovakia  1992-05-01

In [3]:
import pandas as pd
cast=pd.read_csv('cast.csv')

In [57]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [61]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [63]:
cast.isna().sum()

title              0
year               0
name               0
type               0
character          0
n            1458573
dtype: int64

In [65]:
cast.shape

(3786176, 6)

In [ ]:
# How many roles were there in the movie "Inception"?

In [67]:
cast[cast.title == 'Inception']

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3387147,Inception,2010,Ellen Page,actress,Ariadne,3.0
3444628,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3473041,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3480170,Inception,2010,Talulah Riley,actress,Blonde,25.0
3731263,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [6]:
e=cast[cast['title']=='Inception'].shape[0]
e

78

In [ ]:
# How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [30]:
c=cast
c=c[c.title == 'Inception']
c=c[c.n.isnull()]
len(c)

27

In [ ]:
# But how many roles in the movie "Inception" did receive an "n" value?

In [31]:
c=cast
c=c[c.title == 'Inception']
c=c[c.n.notnull()]
len(c)

51

In [ ]:
#Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [37]:
c=cast
c=c[c.title == 'North by Northwest']
c=c[c.n.notnull()].sort_values('n')
c.iloc[:,5:]

            n
871426    1.0
3518333   2.0
1457165   3.0
3157232   4.0
356707    5.0
3048272   6.0
1695173   7.0
1275337   8.0
2447081   9.0
1811387  10.0
665768   11.0
2295714  12.0
464736   13.0
1508344  14.0
206471   15.0
1384780  16.0

In [ ]:
# Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [44]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [53]:
m=cast[cast.title == "Sleuth" ].sort_values('n')
n=m[m.year == 1972]
n

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

In [ ]:
# Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [54]:
m=cast[cast.title == "Sleuth" ].sort_values('n')
n=m[m.year == 2007]
n

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [ ]:
# How many roles were credited in the silent 1921 version of Hamlet?

In [58]:
cast[(cast['title']=='Hamlet') & (cast['year']==1921)].character.shape[0]

9

In [ ]:
# How many roles were credited in Branagh’s 1996 Hamlet?

In [59]:
cast[(cast['title']=='Hamlet') & (cast['year']==1996)].character.shape[0]

54